Autodesk.Revit.Exceptions.ServerModelCorruptedException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.ServerModelCorruptedException
The exception thrown when the model is corrupted.
Since: 2025.2